wolgwang1729/SoB-SeedSigner-Bootloader-Journey/Phase_10/seedsigner_bootloader_p4_stateless_os/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_PARTITION_TABLE_OFFSET=0x20000
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_FREERTOS_UNICORE=y
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y

# ESP32-P4 specific chip revision (v1.3 board support)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# PSRAM support (ESP32-P4 dev board has PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Disable PMP IDRAM split — our loader needs to overwrite IRAM at 0x4FF00000
# with the payload's code. The default split marks IRAM as execute-only with
# LOCKED PMP entries that can't be modified at runtime.
CONFIG_ESP_SYSTEM_PMP_IDRAM_SPLIT=n
CONFIG_ESP_ENABLE_PVT=n
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
